                org 7C00h
start:
; Инициализируем сегменты
                mov             ax,cs
                mov             ds,ax
                mov             es,ax
                mov             ss,ax
                xor             sp,sp
; Очищаем экран
                mov             ax,3
                int             10h
; Загружаем шрифт
                mov             ax,1110h
                mov             cx,8                ; Число знаков
                mov             dx,160              ; Смещение на символ.
                mov             bx,1000h            ; 16 байт на символ
                mov             bp, font
                int             10h
; Загружаем псевдографику
                mov             ax,1110h
                mov             cx,2                ; Число знаков
                mov             dx,0B0h             ; Смещение на символ. Псевдографика B0-B1
                mov             bx,1000h            ; 16 байт на символ
                mov             bp, graph
                int             10h

; Выводим текст
                mov             ax,1300h            ; Печать строки светом bl
                mov             bp, fio             ; Смещение на выводимую строку
                mov             cx,36               ; Длина строки
                mov             bx,27h              ; Нулевая страница, цвет 39
                mov             dx,0B00h            ; DH,DL = строка,колонка начала вывода
                int             10h

; Выводим треугольник
                mov             cx,3                ; Всего будет три строки
                mov             dx,0A4Ah            ; DH,DL = строка,колонка начала вывода
                mov             ax,1300h            ; Печать строки светом bl
                mov             bx,11               ; Нулевая страница, цвет 11
; Цикл печати строк
m1:                
                push            cx
                push            dx
; Печатаем закрашенные прямоугольники в количестве (cx-1)*2, т.е. 4, 2, 0
                mov             bp, trg1
                dec             cx
                jz              m3
                add             cx,cx
m2:
                push            cx
                mov             cx,1
                int             10h
                pop             cx
                inc             dx
                loop            m2
m3:
; Печатаем треугольное завершение
                mov             cx,2
                mov             bp, trg2
                int             10h
                pop             dx
                pop             cx
                inc             dh
                loop            m1
                
                xor             ax,ax               ; Ожидаем нажатия клавиши
                int             16h
; Здесь должна начать работу операционная система...  
; Местоположение: Х: Слева, Y: Центр, Фигура – треугольник       
; Иномов Хуррам Хуршедович, HMT-393907
fio             db              167
                db              164
                db              "o"
                db              163
                db              "o"
                db              160
                db              " "
                db              "X"
                db              "y"
                db              "p"
                db              "p"
                db              "a"
                db              163
                db              " "
                db              "X"
                db              "y"
                db              "p"
                db              166
                db              "e"
                db              161
                db              "o"
                db              160
                db              162
                db              165
                db              ", HMT-393907"
trg1            db              0DBh
trg2            db              0B0h,0B1h

font:
rus_v   db 000,000,000,000,000,252,102,102,124,102,102,252,000,000,000,000 ; 160
rus_d   db 000,000,000,000,000,030,054,054,102,102,102,255,195,195,000,000 ; 161
rus_i   db 000,000,000,000,000,198,198,206,214,230,198,198,000,000,000,000 ; 162
rus_m   db 000,000,000,000,000,198,238,254,254,214,214,198,000,000,000,000 ; 163
rus_n   db 000,000,000,000,000,198,198,198,254,198,198,198,000,000,000,000 ; 164
rus_ch  db 000,000,000,000,000,198,198,198,198,126,006,006,000,000,000,000 ; 165
rus_sh  db 000,000,000,000,000,214,214,214,214,214,214,254,000,000,000,000 ; 166
rus_BI  db 000,000,198,198,206,206,214,230,230,198,198,198,000,000,000,000 ; 167

graph:
                db              11111111b       ; B0
                db              11111111b
                db              11111111b
                db              11111111b
                db              11111111b
                db              11111111b
                db              11111111b
                db              11111111b
                db              11111111b
                db              11111110b
                db              11111100b
                db              11111000b
                db              11110000b
                db              11100000b
                db              11000000b
                db              10000000b

                db              11111111b       ; B1
                db              11111110b
                db              11111100b
                db              11111000b
                db              11110000b
                db              11100000b
                db              11000000b
                db              10000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b

                db              510-($-$$) dup 0 ; Нули для заполнения остатков до конца сектора
                
                dw              0AA55h  ; Признак загрузочного сектора